backend/app/Models/CondicionesMeteorologicasModel.php

SELECT COUNT(*) AS `numrows`
FROM `CondicionesMeteorologicas`
---
    public function getCondiciones($id = null, $perPage = null)
    {
        try {
            // Ordenar por la fecha más reciente
            $this->orderBy('Fecha', 'DESC');

            // Si se pasa un ID, devolveremos una sola condición meteorológica
            if ($id !== null) {
                return $this->find($id);
            }

            // Si se pasa un parámetro de paginación, lo usamos
            if ($perPage !== null) {
                return $this->paginate($perPage);