backend/app/Models/IdeasModel.php

    public function getIdeas($id = null, $perPage = null)
    {
        try {
            $this->select('Ideas.*, Usuarios.Nombre, Usuarios.Username')
                 ->join('Usuarios', 'Ideas.UsuarioID = Usuarios.ID');

            if ($id !== null) {
                return $this->find($id);
---
SELECT `Ideas`.*, `Usuarios`.`Nombre`, `Usuarios`.`Username`
FROM `Ideas`
JOIN `Usuarios` ON `Ideas`.`UsuarioID` = `Usuarios`.`ID`
WHERE `Ideas`.`ID` = '10'
ORDER BY `Ideas`.`ID` DESC