backend/app/Models/LoginLogModel.php

    public function logLoginAttempt($userId, $success, $ip, $userAgent, $attempts = 1, $reason = null)
    {
        // Si el login falla, incrementamos el número de intentos
        if ($success == 0) {
            $attempts++;
        }

        // Si el login falla, ponemos UsuarioID a NULL
        $usuarioID = ($success == 1) ? $userId : null;

        // Si el login es exitoso, establecemos un mensaje en reason
        if ($success == 1 && $reason === null) {
            $reason = 'Login exitoso';
        }

        return $this->insert([
            'UsuarioID' => $usuarioID,
            'FechaHora' => date('Y-m-d H:i:s'),
            'Success' => $success,
            'IpAddress' => $ip,
            'UserAgent' => $userAgent,
            'AttemptDate' => date('Y-m-d'),
            'Attempts' => $attempts,
            'Reason' => $reason
        ]);
---
INSERT INTO `LoginLog` (`UsuarioID`, `FechaHora`, `Success`, `IpAddress`, `UserAgent`, `AttemptDate`, `Attempts`, `Reason`) VALUES (NULL, '2025-03-22 23:41:39', 0, '172.18.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/134.0.0.0 Safari/537.36', '2025-03-22', 2, 'Usuario no encontrado')