backend/app/Models/ModelosFundasModel.php

SELECT `ModelosFundas`.`ID`, `ModelosFundas`.`Nombre`, `ModelosFundas`.`Tamaño`, `ModelosFundas`.`CapacidadCarga`, `ModelosFundas`.`Expansible`, `ModelosFundas`.`ImagenURL`, `ModelosFundas`.`TipoFunda`, `ModelosFundas`.`FechaCreacion`
FROM `ModelosFundas`
ORDER BY `ModelosFundas`.`ID` DESC
---
    public function getModelosFundas($id = null)
    {
        try {
            // Consulta básica para obtener los datos
            $query = $this->db->table('ModelosFundas')
                ->select('ModelosFundas.ID, ModelosFundas.Nombre, ModelosFundas.Tamaño, ModelosFundas.CapacidadCarga, ModelosFundas.Expansible, ModelosFundas.ImagenURL, ModelosFundas.Cantidad, ModelosFundas.Precio, ModelosFundas.TipoFunda, ModelosFundas.FechaCreacion')
                ->orderBy('ModelosFundas.ID', 'DESC');

            // Si se proporciona un ID, filtrar por ese ID específico
            if ($id !== null) {
                $query->where('ModelosFundas.ID', $id);
                return $query->get()->getRowArray();
            }

            // Devolver todos los registros
            return $query->get()->getResultArray();