backend/app/Models/ProveedoresModel.php

SELECT `Proveedores`.`ID`, `Proveedores`.`Nombre`, `Proveedores`.`Pais`, `Proveedores`.`ContactoNombre`, `Proveedores`.`ContactoTelefono`, `Proveedores`.`ContactoEmail`, `Proveedores`.`SitioWeb`, `Proveedores`.`Direccion`, `Proveedores`.`Descripcion`, `Proveedores`.`FechaCreacion`, `Proveedores`.`Activo`
FROM `Proveedores`
ORDER BY `Proveedores`.`ID` DESC
---
    public function getProveedores($id = null)
    {
        try {
            $query = $this->db->table('Proveedores')
                ->select('Proveedores.ID, Proveedores.Nombre, Proveedores.Pais, Proveedores.ContactoNombre, Proveedores.ContactoTelefono, Proveedores.ContactoEmail, Proveedores.SitioWeb, Proveedores.Direccion, Proveedores.Descripcion, Proveedores.FechaCreacion, Proveedores.Activo')
                ->orderBy('Proveedores.ID', 'DESC');

            if ($id !== null) {
                $query->where('Proveedores.ID', $id);
                return $query->get()->getRowArray();
            }

            return $query->get()->getResultArray();