backend/app/Models/SimulacionesModel.php

SELECT COUNT(*) AS `numrows`
FROM `Simulaciones`
JOIN `Usuarios` ON `Usuarios`.`ID` = `Simulaciones`.`UsuarioID`
JOIN `CondicionesMeteorologicas` ON `CondicionesMeteorologicas`.`ID` = `Simulaciones`.`CondicionesMeteorologicasID`
SELECT `Simulaciones`.`ID`, `Simulaciones`.`UsuarioID`, `Simulaciones`.`CondicionLuz`, `Simulaciones`.`EnergiaGenerada`, `Simulaciones`.`Tiempo`, `Simulaciones`.`Fecha`, `Simulaciones`.`CondicionesMeteorologicasID`, `Simulaciones`.`FundaID`, `Usuarios`.`Nombre` AS `UsuarioNombre`
FROM `Simulaciones`
JOIN `Usuarios` ON `Usuarios`.`ID` = `Simulaciones`.`UsuarioID`
JOIN `CondicionesMeteorologicas` ON `CondicionesMeteorologicas`.`ID` = `Simulaciones`.`CondicionesMeteorologicasID`
 LIMIT 10
SELECT `Simulaciones`.`ID`, `Simulaciones`.`UsuarioID`, `Simulaciones`.`CondicionLuz`, `Simulaciones`.`EnergiaGenerada`, `Simulaciones`.`Tiempo`, `Simulaciones`.`Fecha`, `Simulaciones`.`CondicionesMeteorologicasID`, `Simulaciones`.`FundaID`, `CondicionesMeteorologicas`.`LuzSolar`, `CondicionesMeteorologicas`.`Temperatura`, `CondicionesMeteorologicas`.`Humedad`, `CondicionesMeteorologicas`.`Viento`, `Usuarios`.`Nombre` AS `UsuarioNombre`
FROM `Simulaciones`
JOIN `Usuarios` ON `Usuarios`.`ID` = `Simulaciones`.`UsuarioID`
JOIN `CondicionesMeteorologicas` ON `CondicionesMeteorologicas`.`ID` = `Simulaciones`.`CondicionesMeteorologicasID`
WHERE `Simulaciones`.`ID` = '8'
---
    public function getSimulaciones($id = null)
    {
        // Si no se pasa un ID, obtenemos las simulaciones con paginación
        if ($id === null) {
            return $this->select('Simulaciones.ID, Simulaciones.UsuarioID, Simulaciones.CondicionLuz, Simulaciones.EnergiaGenerada, Simulaciones.Tiempo, Simulaciones.Fecha, Simulaciones.CondicionesMeteorologicasID, Simulaciones.FundaID, Usuarios.Nombre AS UsuarioNombre')
                ->join('Usuarios', 'Usuarios.ID = Simulaciones.UsuarioID')
                ->join('CondicionesMeteorologicas', 'CondicionesMeteorologicas.ID = Simulaciones.CondicionesMeteorologicasID')
                ->paginate(10);
        }

        // Si se pasa un ID, obtenemos una simulación específica
        return $this->select('Simulaciones.ID, Simulaciones.UsuarioID, Simulaciones.CondicionLuz, Simulaciones.EnergiaGenerada, Simulaciones.Tiempo, Simulaciones.Fecha, Simulaciones.CondicionesMeteorologicasID, Simulaciones.FundaID, CondicionesMeteorologicas.LuzSolar, CondicionesMeteorologicas.Temperatura, CondicionesMeteorologicas.Humedad, CondicionesMeteorologicas.Viento, Usuarios.Nombre AS UsuarioNombre')
            ->join('Usuarios', 'Usuarios.ID = Simulaciones.UsuarioID')
            ->join('CondicionesMeteorologicas', 'CondicionesMeteorologicas.ID = Simulaciones.CondicionesMeteorologicasID')
            ->find($id);

SELECT DISTINCT `ModelosFundas`.*
FROM `ModelosFundas`
WHERE `ModelosFundas`.`CapacidadCarga` >= '22000.00'
OR `ModelosFundas`.`TipoFunda` = 'Luz artificial'
AND `ModelosFundas`.`ID` NOT IN ('8')
 LIMIT 4
---
    public function obtenerFundasSimilares($condicionLuz, $capacidadCarga, $fundaPropuestaID)
    {
        return $this->db->table('ModelosFundas')
            ->select('ModelosFundas.*')
            ->distinct()
            ->where('ModelosFundas.CapacidadCarga >=', $capacidadCarga)
            ->orWhere('ModelosFundas.TipoFunda', $condicionLuz)
            ->whereNotIn('ModelosFundas.ID', [$fundaPropuestaID])
            ->limit(4)
            ->get()
            ->getResultArray();