backend/app/Models/UsuariosModel.php

    public function checkUser($username, $password)
    {
        $user = $this->where('Username', $username)->first();
---
SELECT *
FROM `Usuarios`
WHERE `Username` = 'gggg'
 LIMIT 1

    public function hasRole($userId, $role)
    {
        $user = $this->find($userId);
---
SELECT *
FROM `Usuarios`
WHERE `Usuarios`.`ID` = '4'