backend/app/Controllers/Ideas.php

SELECT *
FROM `Ideas`
WHERE `Ideas`.`ID` = '11'
DELETE FROM `Ideas`
WHERE `ID` IN ('11')
---
    public function delete($id)
    {
        // Verificar si el usuario tiene acceso de administrador
        $this->checkAdminAccess();

        // Verificar si el ID es válido (no vacío o nulo)
        if (is_null($id) || !is_numeric($id)) {
            // Redirigir con un mensaje de error si el ID es inválido
            return redirect()->to(base_url('admin/ideas'))->with('error', 'ID de idea inválido.');
        }

        // Intentar eliminar la idea
        $idea = $this->ideasModel->find($id);

        if (!$idea) {
            // Si no se encuentra la idea en la base de datos, redirigir con un error
            return redirect()->to(base_url('admin/ideas'))->with('error', "No se encontró la idea con ID: $id.");
        }

        // Realizar la eliminación de la idea
        if ($this->ideasModel->delete($id)) {