backend/app/Controllers/Simulaciones.php

    public function index()
    {
        // Verificamos si el tiempo fue enviado por el usuario
        $tiempo = $this->request->getPost('tiempo');  // Suponiendo que el campo en el formulario se llama 'tiempo'

        // Validamos que el tiempo sea un número y mayor que 0
        if (!is_numeric($tiempo) || $tiempo <= 0) {
            // Si el tiempo no es válido, asignamos un valor predeterminado o devolvemos un error
            $tiempo = 60; // Asignamos un valor predeterminado, 60 minutos
        }

        // Obtener las simulaciones de la base de datos
        $simulaciones = $this->simulacionesModel->getSimulaciones();

        // Iterar sobre las simulaciones y calcular la energía generada para cada una
        foreach ($simulaciones as &$simulacion) {
            // Obtener las condiciones meteorológicas para cada simulación
            $condicionesMeteorologicas = $this->condicionesMeteorologicasModel->find($simulacion['CondicionesMeteorologicasID']);
---
SELECT *
FROM `CondicionesMeteorologicas`
WHERE `CondicionesMeteorologicas`.`ID` = '1'

    public function view($id = null)
    {
        try {
            // Obtener la simulación
            $simulacion = $this->simulacionesModel->getSimulaciones($id);

            if (!$simulacion) {
                throw new PageNotFoundException("No se encontró la simulación con ID: $id");
            }

            // Obtener el ID de las condiciones meteorológicas desde la simulación
            $condicionesMeteorologicasID = $simulacion['CondicionesMeteorologicasID'];

            // Usamos el modelo CondicionesMeteorologicasModel para obtener las condiciones meteorológicas
            $condicionesMeteorologicas = $this->condicionesMeteorologicasModel->find($condicionesMeteorologicasID);
---
SELECT *
FROM `CondicionesMeteorologicas`
WHERE `CondicionesMeteorologicas`.`ID` = '2'

    public function update($id)
    {
        $this->checkAdminAccess();
        helper('form');

        // Obtener la simulación existente por su ID
        $simulacion = $this->simulacionesModel->find($id);
        if (!$simulacion) {
            throw new PageNotFoundException("No se encontró la simulación con ID: $id");
        }

        // Obtener las condiciones meteorológicas relacionadas
        $condicionesMeteorologicas = $this->condicionesMeteorologicasModel->find($simulacion['CondicionesMeteorologicasID']);
---
SELECT *
FROM `Simulaciones`
WHERE `Simulaciones`.`ID` = '4'
SELECT *
FROM `Simulaciones`
WHERE `Simulaciones`.`ID` = '6'
SELECT *
FROM `CondicionesMeteorologicas`
WHERE `CondicionesMeteorologicas`.`ID` = '1'

        $fundasOpcionales = $this->simulacionesModel->obtenerFundasSimilares($simulacion['CondicionLuz'], $capacidadCarga, $fundaRecomendada);

        // Obtener las condiciones meteorológicas para el formulario
        $condicionesMeteorologicasList = $this->condicionesMeteorologicasModel->findAll();
---
SELECT *
FROM `CondicionesMeteorologicas`

    public function updatedItem($id)
    {
        $this->checkAdminAccess();
        helper(['form', 'url']);

        // Validación de datos del formulario
        if (!$this->validate([
            'CondicionLuz' => 'required',
            'Tiempo' => 'required|numeric',
            'CondicionesMeteorologicasID' => 'required|is_not_unique[CondicionesMeteorologicas.ID]'
        ])) {
            return redirect()->to(base_url('admin/simulaciones/update/' . $id))
                ->withInput()
                ->with('error', 'Por favor complete todos los campos correctamente.');
        }

        // Obtener la simulación existente
        $simulacion = $this->simulacionesModel->find($id);
        if (!$simulacion) {
            throw new PageNotFoundException("No se encontró la simulación con ID: $id");
        }

        // Obtener las condiciones meteorológicas para recalcular la energía
        $condicionesMeteorologicas = $this->condicionesMeteorologicasModel->find($this->request->getPost('CondicionesMeteorologicasID'));
---
SELECT *
FROM `Simulaciones`
WHERE `Simulaciones`.`ID` = '4'
SELECT *
FROM `CondicionesMeteorologicas`
WHERE `CondicionesMeteorologicas`.`ID` = '12'

        );

        // Actualizar la simulación con los nuevos datos
        $this->simulacionesModel->update($id, [
            'CondicionLuz' => $this->request->getPost('CondicionLuz'),
            'Tiempo' => $this->request->getPost('Tiempo'),
            'CondicionesMeteorologicasID' => $this->request->getPost('CondicionesMeteorologicasID'),
            'EnergiaGenerada' => $energiaGenerada  // Guardar la nueva energía generada
        ]);
---
UPDATE `Simulaciones` SET `CondicionLuz` = 'Luz Artificial', `Tiempo` = '30.00', `CondicionesMeteorologicasID` = '12', `EnergiaGenerada` = '3.34'
WHERE `Simulaciones`.`ID` IN ('4')