backend/app/Controllers/Simulaciones.php

DELETE FROM `Simulaciones`
WHERE `ID` IN ('6')
---
    public function delete($id)
    {
        $this->checkAdminAccess();

        // Verificar si el ID es válido
        if (!is_numeric($id) || $id <= 0) {
            return redirect()->to(base_url('admin/simulaciones'))->with('error', 'ID no válido para eliminar.');
        }

        // Verificar si la simulación existe
        $simulacion = $this->simulacionesModel->find($id);
        if (!$simulacion) {
            return redirect()->to(base_url('admin/simulaciones'))->with('error', "Simulación con ID: $id no encontrada.");
        }

        try {
            // Eliminar la simulación
            if (!$this->simulacionesModel->delete($id)) {