backend/app/Controllers/Usuarios.php

SELECT *
FROM `Usuarios`
---
    public function index()
    {
        $this->checkAdminAccess();

        $data = [
            'users' => $this->usuariosModel->findAll(),
            'title' => 'Lista de Usuarios',
        ];