backend/app/Controllers/Api/CarritoApi.php

    public function index()
    {
        $user = session()->get('userData');
        $userId = $user->user_id;

        $items = $this->model
            ->select('Carrito.*, ModelosFundas.Nombre as NombreFunda')
            ->join('ModelosFundas', 'ModelosFundas.ID = Carrito.ModelosFundasId')
            ->where('UsuarioId', $userId)
            ->findAll();
---
SELECT `Carrito`.*, `ModelosFundas`.`Nombre` as `NombreFunda`
FROM `Carrito`
JOIN `ModelosFundas` ON `ModelosFundas`.`ID` = `Carrito`.`ModelosFundasId`
WHERE `UsuarioId` IS NULL