backend/app/Controllers/Api/IdeasApi.php

SELECT `i`.*, `u`.`Nombre` as `UsuarioNombre`
FROM `Ideas` `i`
LEFT JOIN `Usuarios` `u` ON `u`.`ID` = `i`.`UsuarioID`
ORDER BY `i`.`FechaCreacion` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `Ideas`
---
    public function index()
    {
        $perPage = $this->request->getGet('perPage') ?? 10;
        $page = $this->request->getGet('page') ?? 1;
        $offset = ($page - 1) * $perPage;

        // Usamos el query builder para hacer JOIN
        $builder = $this->db->table('Ideas i')
            ->select('i.*, u.Nombre as UsuarioNombre')
            ->join('Usuarios u', 'u.ID = i.UsuarioID', 'left')
            ->orderBy('i.FechaCreacion', 'DESC')
            ->limit($perPage, $offset);

        $ideas = $builder->get()->getResultArray();

        // Contamos total sin límite para paginación
        $totalIdeas = $this->db->table('Ideas')->countAllResults();