backend/app/Controllers/Api/SimulacionesApi.php

    public function index()
    {
        $simulaciones = $this->simulacionesModel->findAll();
---
SELECT *
FROM `Simulaciones`