backend/app/Controllers/Api/UsuariosApiController.php

SELECT *
FROM `Usuarios`
WHERE `username` = 'luigip'
 LIMIT 1
---
    public function login()
    {
        $this->setCorsHeaders();

        if ($this->request->getMethod() === 'options') {
            return $this->response->setStatusCode(204);
        }

        // Obtener datos JSON o datos POST
        $data = $this->request->getJSON(true); // Devuelve como array asociativo
        if (!$data) {
            $data = $this->request->getPost(); // Alternativa: application/x-www-form-urlencoded
        }

        // Validar que se obtuvieron los datos necesarios
        if (!isset($data['username']) || !isset($data['password'])) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Campos de usuario y contraseña son requeridos.'
            ])->setStatusCode(400);
        }

        $username = $data['username'];
        $password = $data['password'];

        // Verificar el usuario en la base de datos
        $user = $this->usuariosModel->where('username', $username)->first();